JacksonOvO/Software_VX_4208/Drivers/inc/STM32F0IAPDriver.h
/******************************************************************
*
*文件名称:  STM32F0IAPDriver.h
*文件标识:
*内容摘要:
*其它说明:
*当前版本:
*
*修改记录1:
*    修改日期:
*    版 本 号:
*    修 改 人:
*    修改内容:
******************************************************************/

#ifndef __STM32F0_IAP_H
#define __STM32F0_IAP_H

/******************************************************************
*                             头文件                              *
******************************************************************/

/******************************************************************
*                            常量                                 *
******************************************************************/

/******************************************************************
*                           宏定义                                *
******************************************************************/
#define __IAP_IO    volatile     
#define __IAP_I     volatile             /*!< defines 'read only' permissions                 */

/******************************************************************
*                           数据类型                              *
******************************************************************/
typedef unsigned char IAP_uint8_t;
typedef unsigned short IAP_uint16_t;
typedef unsigned int IAP_uint32_t;

/*IAP返回值定义*/    
typedef enum
{
    E_IAP_OK = 0,
    E_IAP_CONTENT__FRAME_CHECK_ERROR,
    E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_SN_ERROR,  /*升级内容,升级包顺序号错误*/
    E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_SIZE_ERROR, /*升级包大小错误*/
    E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_NUM_ERROR,  /*升级包序列号错误*/
    E_IAP_CONTENT__FRAME_CHECK_UPGRADE_PACKAGE_RETRANSMISSION_ERROR,
    E_IAP_RAM_TO_FLASH_ERROR,          /*从RAM向FLASH拷贝错误*/
    E_IAP_BUTT    
}IAP_Result_e;

typedef struct
{
  __IAP_IO IAP_uint32_t MODER;        /*!< GPIO port mode register,                                  Address offset: 0x00 */
  __IAP_IO IAP_uint16_t OTYPER;       /*!< GPIO port output type register,                           Address offset: 0x04 */
  IAP_uint16_t RESERVED0;         /*!< Reserved,                                                                 0x06 */
  __IAP_IO IAP_uint32_t OSPEEDR;      /*!< GPIO port output speed register,                          Address offset: 0x08 */
  __IAP_IO IAP_uint32_t PUPDR;        /*!< GPIO port pull-up/pull-down register,                     Address offset: 0x0C */
  __IAP_IO IAP_uint16_t IDR;          /*!< GPIO port input data register,                            Address offset: 0x10 */
  IAP_uint16_t RESERVED1;         /*!< Reserved,                                                                 0x12 */
  __IAP_IO IAP_uint16_t ODR;          /*!< GPIO port output data register,                           Address offset: 0x14 */
  IAP_uint16_t RESERVED2;         /*!< Reserved,                                                                 0x16 */
  __IAP_IO IAP_uint32_t BSRR;         /*!< GPIO port bit set/reset registerBSRR,                     Address offset: 0x18 */
  __IAP_IO IAP_uint32_t LCKR;         /*!< GPIO port configuration lock register,                    Address offset: 0x1C */
  __IAP_IO IAP_uint32_t AFR[2];       /*!< GPIO alternate function low register,                Address offset: 0x20-0x24 */
  __IAP_IO IAP_uint16_t BRR;          /*!< GPIO bit reset register,                                  Address offset: 0x28 */
  IAP_uint16_t RESERVED3;         /*!< Reserved,                                                                 0x2A */
}IAP_GPIO_TypeDef;

typedef struct
{
  __IAP_IO IAP_uint32_t CCR;          /*!< DMA channel x configuration register                                           */
  __IAP_IO IAP_uint32_t CNDTR;        /*!< DMA channel x number of data register                                          */
  __IAP_IO IAP_uint32_t CPAR;         /*!< DMA channel x peripheral address register                                      */
  __IAP_IO IAP_uint32_t CMAR;         /*!< DMA channel x memory address register                                          */
}IAP_DMA_Channel_TypeDef;

typedef struct
{
  __IAP_IO IAP_uint32_t CR1;    /*!< USART Control register 1,                 Address offset: 0x00 */ 
  __IAP_IO IAP_uint32_t CR2;    /*!< USART Control register 2,                 Address offset: 0x04 */ 
  __IAP_IO IAP_uint32_t CR3;    /*!< USART Control register 3,                 Address offset: 0x08 */
  __IAP_IO IAP_uint16_t BRR;    /*!< USART Baud rate register,                 Address offset: 0x0C */
  IAP_uint16_t  RESERVED1;  /*!< Reserved, 0x0E                                                 */  
  __IAP_IO IAP_uint16_t GTPR;   /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
  IAP_uint16_t  RESERVED2;  /*!< Reserved, 0x12                                                 */
  __IAP_IO IAP_uint32_t RTOR;   /*!< USART Receiver Time Out register,         Address offset: 0x14 */  
  __IAP_IO IAP_uint16_t RQR;    /*!< USART Request register,                   Address offset: 0x18 */
  IAP_uint16_t  RESERVED3;  /*!< Reserved, 0x1A                                                 */
  __IAP_IO IAP_uint32_t ISR;    /*!< USART Interrupt and status register,      Address offset: 0x1C */
  __IAP_IO IAP_uint32_t ICR;    /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
  __IAP_IO IAP_uint16_t RDR;    /*!< USART Receive Data register,              Address offset: 0x24 */
  IAP_uint16_t  RESERVED4;  /*!< Reserved, 0x26                                                 */
  __IAP_IO IAP_uint16_t TDR;    /*!< USART Transmit Data register,             Address offset: 0x28 */
  IAP_uint16_t  RESERVED5;  /*!< Reserved, 0x2A                                                 */
} IAP_USART_TypeDef;

typedef enum {IAP_DISABLE = 0, IAP_ENABLE = !IAP_DISABLE} IAP_FunctionalState;

typedef struct
{
  __IAP_IO IAP_uint32_t CR;         /*!< RCC clock control register,                                  Address offset: 0x00 */
  __IAP_IO IAP_uint32_t CFGR;       /*!< RCC clock configuration register,                            Address offset: 0x04 */
  __IAP_IO IAP_uint32_t CIR;        /*!< RCC clock interrupt register,                                Address offset: 0x08 */
  __IAP_IO IAP_uint32_t APB2RSTR;   /*!< RCC APB2 peripheral reset register,                          Address offset: 0x0C */
  __IAP_IO IAP_uint32_t APB1RSTR;   /*!< RCC APB1 peripheral reset register,                          Address offset: 0x10 */
  __IAP_IO IAP_uint32_t AHBENR;     /*!< RCC AHB peripheral clock register,                           Address offset: 0x14 */
  __IAP_IO IAP_uint32_t APB2ENR;    /*!< RCC APB2 peripheral clock enable register,                   Address offset: 0x18 */
  __IAP_IO IAP_uint32_t APB1ENR;    /*!< RCC APB1 peripheral clock enable register,                   Address offset: 0x1C */
  __IAP_IO IAP_uint32_t BDCR;       /*!< RCC Backup domain control register,                          Address offset: 0x20 */ 
  __IAP_IO IAP_uint32_t CSR;        /*!< RCC clock control & status register,                         Address offset: 0x24 */
  __IAP_IO IAP_uint32_t AHBRSTR;    /*!< RCC AHB peripheral reset register,                           Address offset: 0x28 */
  __IAP_IO IAP_uint32_t CFGR2;      /*!< RCC clock configuration register 2,                          Address offset: 0x2C */
  __IAP_IO IAP_uint32_t CFGR3;      /*!< RCC clock configuration register 3,                          Address offset: 0x30 */
  __IAP_IO IAP_uint32_t CR2;        /*!< RCC clock control register 2,                                Address offset: 0x34 */
} IAP_RCC_TypeDef;

typedef struct
{
  IAP_uint8_t NVIC_IRQChannel;             /*!< Specifies the IRQ channel to be enabled or disabled.
                                            This parameter can be a value of @ref IRQn_Type 
                                            (For the complete STM32 Devices IRQ Channels list, 
                                            please refer to stm32f0xx.h file) */

  IAP_uint8_t NVIC_IRQChannelPriority;     /*!< Specifies the priority level for the IRQ channel specified
                                            in NVIC_IRQChannel. This parameter can be a value
                                            between 0 and 3.  */

  IAP_FunctionalState NVIC_IRQChannelCmd;  /*!< Specifies whether the IRQ channel defined in NVIC_IRQChannel
                                            will be enabled or disabled. 
                                            This parameter can be set either to ENABLE or DISABLE */   
} IAP_NVIC_InitTypeDef;


