JacksonOvO/Software_VX_4208/Drivers/inc/STM32F0IAPDriver.h
typedef enum
{
  IAP_GPIO_Mode_IN   = 0x00, /*!< GPIO Input Mode              */
  IAP_GPIO_Mode_OUT  = 0x01, /*!< GPIO Output Mode             */
  IAP_GPIO_Mode_AF   = 0x02, /*!< GPIO Alternate function Mode */
  IAP_GPIO_Mode_AN   = 0x03  /*!< GPIO Analog In/Out Mode      */
}IAP_GPIOMode_TypeDef;
typedef enum
{
  IAP_GPIO_Speed_Level_1  = 0x01, /*!< Medium Speed */
  IAP_GPIO_Speed_Level_2  = 0x02, /*!< Fast Speed   */
  IAP_GPIO_Speed_Level_3  = 0x03  /*!< High Speed   */
}IAP_GPIOSpeed_TypeDef;
typedef enum
{
  IAP_GPIO_OType_PP = 0x00,
  IAP_GPIO_OType_OD = 0x01
}IAP_GPIOOType_TypeDef;
typedef enum
{
  IAP_GPIO_PuPd_NOPULL = 0x00,
  IAP_GPIO_PuPd_UP     = 0x01,
  IAP_GPIO_PuPd_DOWN   = 0x02
}IAP_GPIOPuPd_TypeDef;

typedef struct
{
  IAP_uint32_t GPIO_Pin;              /*!< Specifies the GPIO pins to be configured.
                                       This parameter can be any value of @ref GPIO_pins_define */
                                       
  IAP_GPIOMode_TypeDef GPIO_Mode;     /*!< Specifies the operating mode for the selected pins.
                                       This parameter can be a value of @ref GPIOMode_TypeDef   */

  IAP_GPIOSpeed_TypeDef GPIO_Speed;   /*!< Specifies the speed for the selected pins.
                                       This parameter can be a value of @ref GPIOSpeed_TypeDef  */

  IAP_GPIOOType_TypeDef GPIO_OType;   /*!< Specifies the operating output type for the selected pins.
                                       This parameter can be a value of @ref GPIOOType_TypeDef  */

  IAP_GPIOPuPd_TypeDef GPIO_PuPd;     /*!< Specifies the operating Pull-up/Pull down for the selected pins.
                                       This parameter can be a value of @ref GPIOPuPd_TypeDef   */
}IAP_GPIO_InitTypeDef;

typedef struct
{
  __IAP_IO IAP_uint32_t ISR;          /*!< DMA interrupt status register,                            Address offset: 0x00 */
  __IAP_IO IAP_uint32_t IFCR;         /*!< DMA interrupt flag clear register,                        Address offset: 0x04 */
} IAP_DMA_TypeDef;

typedef struct
{
  IAP_uint32_t DMA_PeripheralBaseAddr; /*!< Specifies the peripheral base address for DMAy Channelx.              */

  IAP_uint32_t DMA_MemoryBaseAddr;     /*!< Specifies the memory base address for DMAy Channelx.                  */

  IAP_uint32_t DMA_DIR;                /*!< Specifies if the peripheral is the source or destination.
                                        This parameter can be a value of @ref DMA_data_transfer_direction     */

  IAP_uint32_t DMA_BufferSize;         /*!< Specifies the buffer size, in data unit, of the specified Channel. 
                                        The data unit is equal to the configuration set in DMA_PeripheralDataSize
                                        or DMA_MemoryDataSize members depending in the transfer direction     */

  IAP_uint32_t DMA_PeripheralInc;      /*!< Specifies whether the Peripheral address register is incremented or not.
                                        This parameter can be a value of @ref DMA_peripheral_incremented_mode */

  IAP_uint32_t DMA_MemoryInc;          /*!< Specifies whether the memory address register is incremented or not.
                                        This parameter can be a value of @ref DMA_memory_incremented_mode     */

  IAP_uint32_t DMA_PeripheralDataSize; /*!< Specifies the Peripheral data width.
                                        This parameter can be a value of @ref DMA_peripheral_data_size        */

  IAP_uint32_t DMA_MemoryDataSize;     /*!< Specifies the Memory data width.
                                        This parameter can be a value of @ref DMA_memory_data_size            */

  IAP_uint32_t DMA_Mode;               /*!< Specifies the operation mode of the DMAy Channelx.
                                        This parameter can be a value of @ref DMA_circular_normal_mode
                                        @note: The circular buffer mode cannot be used if the memory-to-memory
                                              data transfer is configured on the selected Channel */

  IAP_uint32_t DMA_Priority;           /*!< Specifies the software priority for the DMAy Channelx.
                                        This parameter can be a value of @ref DMA_priority_level              */

  IAP_uint32_t DMA_M2M;                /*!< Specifies if the DMAy Channelx will be used in memory-to-memory transfer.
                                        This parameter can be a value of @ref DMA_memory_to_memory            */
}IAP_DMA_InitTypeDef;
typedef struct
{
  IAP_uint32_t USART_BaudRate;            /*!< This member configures the USART communication baud rate.
                                           The baud rate is computed using the following formula:
                                            - IntegerDivider = ((PCLKx) / (16 * (USART_InitStruct->USART_BaudRate)))
                                            - FractionalDivider = ((IntegerDivider - ((IAP_uint32_t) IntegerDivider)) * 16) + 0.5 */

  IAP_uint32_t USART_WordLength;          /*!< Specifies the number of data bits transmitted or received in a frame.
                                           This parameter can be a value of @ref USART_Word_Length */

  IAP_uint32_t USART_StopBits;            /*!< Specifies the number of stop bits transmitted.
                                           This parameter can be a value of @ref USART_Stop_Bits */

  IAP_uint32_t USART_Parity;              /*!< Specifies the parity mode.
                                           This parameter can be a value of @ref USART_Parity
                                           @note When parity is enabled, the computed parity is inserted
                                                 at the MSB position of the transmitted data (9th bit when
                                                 the word length is set to 9 data bits; 8th bit when the
                                                 word length is set to 8 data bits). */
 
  IAP_uint32_t USART_Mode;                /*!< Specifies wether the Receive or Transmit mode is enabled or disabled.
                                           This parameter can be a value of @ref USART_Mode */

