JacksonOvO/Software_VX_4208/Drivers/inc/STM32F0IAPDriver.h
  IAP_uint32_t USART_HardwareFlowControl; /*!< Specifies wether the hardware flow control mode is enabled
                                           or disabled.
                                           This parameter can be a value of @ref USART_Hardware_Flow_Control*/
} IAP_USART_InitTypeDef;
typedef struct
{
  IAP_uint32_t SYSCLK_Frequency;
  IAP_uint32_t HCLK_Frequency;
  IAP_uint32_t PCLK_Frequency;
  IAP_uint32_t ADCCLK_Frequency;
  IAP_uint32_t CECCLK_Frequency;
  IAP_uint32_t I2C1CLK_Frequency;
  IAP_uint32_t USART1CLK_Frequency;
}IAP_RCC_ClocksTypeDef;
typedef struct
{
  __IAP_IO IAP_uint32_t ACR;          /*!<FLASH access control register,                 Address offset: 0x00 */
  __IAP_IO IAP_uint32_t KEYR;         /*!<FLASH key register,                            Address offset: 0x04 */
  __IAP_IO IAP_uint32_t OPTKEYR;      /*!<FLASH OPT key register,                        Address offset: 0x08 */
  __IAP_IO IAP_uint32_t SR;           /*!<FLASH status register,                         Address offset: 0x0C */
  __IAP_IO IAP_uint32_t CR;           /*!<FLASH control register,                        Address offset: 0x10 */
  __IAP_IO IAP_uint32_t AR;           /*!<FLASH address register,                        Address offset: 0x14 */
  __IAP_IO IAP_uint32_t RESERVED;     /*!< Reserved,                                                     0x18 */
  __IAP_IO IAP_uint32_t OBR;          /*!<FLASH option bytes register,                   Address offset: 0x1C */
  __IAP_IO IAP_uint32_t WRPR;         /*!<FLASH option bytes register,                   Address offset: 0x20 */
} IAP_FLASH_TypeDef;
typedef enum
{
  IAP_FLASH_OK,    
  IAP_FLASH_BUSY = 1,
  IAP_FLASH_ERROR_WRP,
  IAP_FLASH_ERROR_PROGRAM,
  IAP_FLASH_COMPLETE,
  IAP_FLASH_TIMEOUT
}IAP_FLASH_Status;
typedef struct
{
  __IAP_IO IAP_uint32_t ISER[1];                 /*!< Offset: 0x000 (R/W)  Interrupt Set Enable Register           */
       IAP_uint32_t RESERVED0[31];
  __IAP_IO IAP_uint32_t ICER[1];                 /*!< Offset: 0x080 (R/W)  Interrupt Clear Enable Register          */
       IAP_uint32_t RSERVED1[31];
  __IAP_IO IAP_uint32_t ISPR[1];                 /*!< Offset: 0x100 (R/W)  Interrupt Set Pending Register           */
       IAP_uint32_t RESERVED2[31];
  __IAP_IO IAP_uint32_t ICPR[1];                 /*!< Offset: 0x180 (R/W)  Interrupt Clear Pending Register         */
       IAP_uint32_t RESERVED3[31];
       IAP_uint32_t RESERVED4[64];
  __IAP_IO IAP_uint32_t IP[8];                   /*!< Offset: 0x300 (R/W)  Interrupt Priority Register              */
} IAP_NVIC_Type;

typedef struct
{
    IAP_uint32_t uiFlashDestination;
    IAP_uint8_t PageNumber;
}IapSector_t;
/******************************************************************
*                           宏定义                                *
******************************************************************/
/*C语言实现整数除法和模除*/
#define IAP_LOOP_CONTROL      0x80000000
#define IAP_CALCULATE         1

/*标志帧*/
#define IAP_DATA_SECTOR        0
#define IAP_DEVICE_SECTOR      1
#define IAP_VERSION_SECTOR     2
/*DMA通道复用*/
typedef struct
{
  __IAP_IO IAP_uint32_t CFGR1;       /*!< SYSCFG configuration register 1,                           Address offset: 0x00 */
       IAP_uint32_t RESERVED;    /*!< Reserved,                                                                  0x04 */
  __IAP_IO IAP_uint32_t EXTICR[4];   /*!< SYSCFG external interrupt configuration register,     Address offset: 0x14-0x08 */
  __IAP_IO IAP_uint32_t CFGR2;       /*!< SYSCFG configuration register 2,                           Address offset: 0x18 */
} IAP_SYSCFG_TypeDef;

#define IAP_PERIPH_BASE           ((IAP_uint32_t)0x40000000) /*!< Peripheral base address in the alias region */

/*!< Peripheral memory map */
#define IAP_APBPERIPH_BASE        IAP_PERIPH_BASE

#define IAP_SYSCFG_BASE           (IAP_APBPERIPH_BASE + 0x00010000)

#define IAP_SYSCFG              ((IAP_SYSCFG_TypeDef *) IAP_SYSCFG_BASE)

#define IAP_RCC_APB2ENR_SYSCFGEN                ((IAP_uint32_t)0x00000001)        /*!< SYSCFG clock enable */
#define IAP_RCC_APB2Periph_SYSCFG            IAP_RCC_APB2ENR_SYSCFGEN

#define IAP_SYSCFG_CFGR1_USART1RX_DMA_RMP       ((IAP_uint32_t)0x00000400) /*!< USART1 RX DMA remap */
#define IAP_SYSCFG_CFGR1_USART1TX_DMA_RMP       ((IAP_uint32_t)0x00000200) /*!< USART1 TX DMA remap */

/*DMA通道复用*/

#define  IAP_RCC_AHBENR_GPIOAEN                  ((IAP_uint32_t)0x00020000)        /*!< GPIOA clock enable */
#define  IAP_RCC_AHBENR_GPIOBEN                  ((IAP_uint32_t)0x00040000)        /*!< GPIOB clock enable */
#define  IAP_RCC_APB2ENR_USART1EN                ((IAP_uint32_t)0x00004000)        /*!< USART1 clock enable */
#define  IAP_RCC_AHBENR_DMA1EN                   ((IAP_uint32_t)0x00000001)        /*!< DMA1 clock enable */


#define IAP_AHB2PERIPH_BASE       (IAP_PERIPH_BASE + 0x08000000)
#define IAP_GPIOA_BASE            (IAP_AHB2PERIPH_BASE + 0x00000000)
#define IAP_GPIOA                  ((IAP_GPIO_TypeDef *) IAP_GPIOA_BASE)

#define IAP_GPIOB_BASE            (IAP_AHB2PERIPH_BASE + 0x00000400)
#define IAP_GPIOB                   ((IAP_GPIO_TypeDef *) IAP_GPIOB_BASE)

#define IAP_GPIO_PinSource12           ((IAP_uint8_t)0x0C)
#define IAP_GPIO_PinSource9            ((IAP_uint8_t)0x09)
#define IAP_GPIO_PinSource10           ((IAP_uint8_t)0x0A)

#define IAP_GPIO_AF_1            ((IAP_uint8_t)0x01) 

#define IAP_GPIO_Pin_0                 ((IAP_uint16_t)0x0001)  /*!< Pin 0 selected    */
#define IAP_GPIO_Pin_1                 ((IAP_uint16_t)0x0002)  /*!< Pin 1 selected    */
#define IAP_GPIO_Pin_2                 ((IAP_uint16_t)0x0004)  /*!< Pin 2 selected    */
#define IAP_GPIO_Pin_3                 ((IAP_uint16_t)0x0008)  /*!< Pin 3 selected    */
#define IAP_GPIO_Pin_4                 ((IAP_uint16_t)0x0010)  /*!< Pin 4 selected    */
#define IAP_GPIO_Pin_5                 ((IAP_uint16_t)0x0020)  /*!< Pin 5 selected    */
#define IAP_GPIO_Pin_6                 ((IAP_uint16_t)0x0040)  /*!< Pin 6 selected    */
#define IAP_GPIO_Pin_7                 ((IAP_uint16_t)0x0080)  /*!< Pin 7 selected    */
#define IAP_GPIO_Pin_8                 ((IAP_uint16_t)0x0100)  /*!< Pin 8 selected    */
#define IAP_GPIO_Pin_9                 ((IAP_uint16_t)0x0200)  /*!< Pin 9 selected    */
#define IAP_GPIO_Pin_10                ((IAP_uint16_t)0x0400)  /*!< Pin 10 selected   */
#define IAP_GPIO_Pin_11                ((IAP_uint16_t)0x0800)  /*!< Pin 11 selected   */
#define IAP_GPIO_Pin_12                ((IAP_uint16_t)0x1000)  /*!< Pin 12 selected   */
#define IAP_GPIO_Pin_13                ((IAP_uint16_t)0x2000)  /*!< Pin 13 selected   */
#define IAP_GPIO_Pin_14                ((IAP_uint16_t)0x4000)  /*!< Pin 14 selected   */
#define IAP_GPIO_Pin_15                ((IAP_uint16_t)0x8000)  /*!< Pin 15 selected   */
#define IAP_GPIO_Pin_All               ((IAP_uint16_t)0xFFFF)  /*!< All pins selected */



#define IAP_GPIO_Speed_50MHz           ((IAP_uint8_t)0x03)    /*!< High Speed:50MHz   */

#define IAP_USART1_TDR_ADDRESS           (0x40013828)
#define IAP_DMA_DIR_PeripheralDST       ((IAP_uint32_t)0x00000010)
#define IAP_DMA_SEND_BUFSIZE             (256)
#define IAP_DMA_MemoryInc_Enable         ((IAP_uint32_t)0x00000080) 
#define IAP_DMA_PeripheralDataSize_Byte  ((IAP_uint32_t)0x00000000)
#define IAP_DMA_PeripheralDataSize_HalfWord    ((IAP_uint32_t)0x00000100)        /*!< Bit 0                               */

#define IAP_DMA_MemoryDataSize_Byte       ((IAP_uint32_t)0x00000000)
#define IAP_DMA_Mode_Normal                ((IAP_uint32_t)0x00000000)
#define IAP_DMA_Priority_Low                ((IAP_uint32_t)0x00000000)
#define IAP_DMA_M2M_Disable                 ((IAP_uint32_t)0x00000000)

#define IAP_USART1_RDR_ADDRESS               (0x40013824)
#define IAP_DMA_DIR_PeripheralSRC           ((IAP_uint32_t)0x00000000)
#define IAP_DMA_RECEIVE_BUFSIZE               (1024u)
#define IAP_DMA_PeripheralInc_Disable        ((IAP_uint32_t)0x00000000)
#define IAP_USART1_IRQn                        (27)
#define IAP_DMA1_Channel2_3_IRQn              (10)

#define IAP_USART_WordLength_8b               ((IAP_uint32_t)0x00000000)
#define IAP_USART_StopBits_1                  ((IAP_uint32_t)0x00000000)
#define IAP_USART_Parity_No                   ((IAP_uint32_t)0x00000000)
#define IAP_USART_HardwareFlowControl_RTS     ((IAP_uint32_t)0x00000100)
#define IAP_USART_HardwareFlowControl_None       ((IAP_uint32_t)0x00000000)

#define IAP_USART_Mode_Rx                      ((IAP_uint32_t)0x00000004)
#define IAP_USART_Mode_Tx                      ((IAP_uint32_t)0x00000008)

#define IAP_DMA1_Channel2       ((IAP_DMA_Channel_TypeDef *) IAP_DMA1_Channel2_BASE)
#define IAP_DMA1_Channel2_BASE    (IAP_DMA1_BASE + 0x0000001C)
#define IAP_DMA1_BASE             (IAP_AHBPERIPH_BASE + 0x00000000)
#define IAP_AHBPERIPH_BASE        (IAP_PERIPH_BASE + 0x00020000)
#define IAP_DMA1_Channel3_BASE    (IAP_DMA1_BASE + 0x00000030)
#define IAP_DMA1_Channel3       ((IAP_DMA_Channel_TypeDef *) IAP_DMA1_Channel3_BASE)
#define IAP_USART_DMAReq_Rx       ((IAP_uint32_t)0x00000040)            /*!< DMA Enable Receiver */

#define IAP_USART_DMAReq_Tx                      IAP_USART_CR3_DMAT
#define IAP_USART_CR3_DMAT                      ((IAP_uint32_t)0x00000080)            /*!< DMA Enable Transmitter */


#define IAP_USART1_BASE           (IAP_APBPERIPH_BASE + 0x00013800)
#define IAP_USART1              ((IAP_USART_TypeDef *) IAP_USART1_BASE)

#define IAP_RCC_BASE              (IAP_AHBPERIPH_BASE + 0x00001000)
#define IAP_RCC                 ((IAP_RCC_TypeDef *) IAP_RCC_BASE)

