JacksonOvO/Software_VX_4208/Drivers/inc/STM32F0IAPDriver.h
#define IAP_IS_RCC_AHB_PERIPH(PERIPH) ((((PERIPH) & 0xFEA1FFAA) == 0x00) && ((PERIPH) != 0x00))
#define IAP_IS_FUNCTIONAL_STATE(STATE) (((STATE) == 0) || ((STATE) == 1))
#define IAP_IS_RCC_APB2_PERIPH(PERIPH) ((((PERIPH) & 0xFFB8A5FE) == 0x00) && ((PERIPH) != 0x00))

#define IAP_SCS_BASE            (0xE000E000UL) 

#define IAP_NVIC_BASE           (IAP_SCS_BASE +  0x0100UL)                    /*!< NVIC Base Address                 */
#define IAP_NVIC                ((IAP_NVIC_Type      *)     IAP_NVIC_BASE     )   /*!< NVIC configuration struct          */

#define IAP_GPIO_OSPEEDER_OSPEEDR0     ((IAP_uint32_t)0x00000003)
#define IAP_GPIO_OTYPER_OT_0           ((IAP_uint32_t)0x00000001)
#define IAP_GPIO_MODER_MODER0          ((IAP_uint32_t)0x00000003)
#define IAP_GPIO_PUPDR_PUPDR0          ((IAP_uint32_t)0x00000003)

#define IAP_DMA_CCR_EN                  ((IAP_uint32_t)0x00000001)        /*!< Channel enable                      */
//#define IAP_DMA1_BASE             (IAP_AHBPERIPH_BASE + 0x00000000)
#define IAP_DMA1                ((IAP_DMA_TypeDef *) IAP_DMA1_BASE)
#define IAP_DMA_ISR_GIF2                        ((IAP_uint32_t)0x00000010)        /*!< Channel 2 Global interrupt flag    */
#define IAP_DMA_ISR_TCIF2                       ((IAP_uint32_t)0x00000020)        /*!< Channel 2 Transfer Complete flag   */
#define IAP_DMA_ISR_HTIF2                       ((IAP_uint32_t)0x00000040)        /*!< Channel 2 Half Transfer flag       */
#define IAP_DMA_ISR_TEIF2                       ((IAP_uint32_t)0x00000080)        /*!< Channel 2 Transfer Error flag      */
#define IAP_DMA_ISR_GIF3                        ((IAP_uint32_t)0x00000100)        /*!< Channel 3 Global interrupt flag    */
#define IAP_DMA_ISR_TCIF3                       ((IAP_uint32_t)0x00000200)        /*!< Channel 3 Transfer Complete flag   */
#define IAP_DMA_ISR_HTIF3                       ((IAP_uint32_t)0x00000400)        /*!< Channel 3 Half Transfer flag       */
#define IAP_DMA_ISR_TEIF3                       ((IAP_uint32_t)0x00000800)        /*!< Channel 3 Transfer Error flag      */
#define IAP_DMA1_CHANNEL2_IT_MASK    ((IAP_uint32_t)(IAP_DMA_ISR_GIF2 | IAP_DMA_ISR_TCIF2 | IAP_DMA_ISR_HTIF2 | IAP_DMA_ISR_TEIF2))
#define IAP_DMA1_CHANNEL3_IT_MASK    ((IAP_uint32_t)(IAP_DMA_ISR_GIF3 | IAP_DMA_ISR_TCIF3 | IAP_DMA_ISR_HTIF3 | IAP_DMA_ISR_TEIF3))
#define IAP_CCR_CLEAR_MASK                ((IAP_uint32_t)0xFFFF800F) /* DMA Channel config registers Masks */
#define IAP_USART_CR1_UE                        ((IAP_uint32_t)0x00000001)            /*!< USART Enable */
#define IAP_USART_CR2_STOP                      ((IAP_uint32_t)0x00003000)            /*!< STOP[1:0] bits (STOP bits) */
#define IAP_CR1_CLEAR_MASK          ((IAP_uint32_t)0x00CFE0FF)  /*<! I2C CR1 clear register Mask */
#define IAP_USART_CR3_RTSE                      ((IAP_uint32_t)0x00000100)            /*!< RTS Enable */
#define IAP_USART_CR3_CTSE                      ((IAP_uint32_t)0x00000200)            /*!< CTS Enable */
#define IAP_CR3_CLEAR_MASK            ((IAP_uint32_t)(IAP_USART_CR3_RTSE | IAP_USART_CR3_CTSE))
#define IAP_USART_CR1_OVER8                     ((IAP_uint32_t)0x00008000)            /*!< Oversampling by 8-bit or 16-bit mode */

#define IAP_RCC_CFGR_SWS                        ((IAP_uint32_t)0x0000000C)        /*!< SWS[1:0] bits (System Clock Switch Status) */
#define IAP_HSI_VALUE                            ((IAP_uint32_t)8000000)
#define IAP_HSE_VALUE                            ((IAP_uint32_t)12000000)
#define IAP_RCC_CFGR_PLLMULL                    ((IAP_uint32_t)0x003C0000)        /*!< PLLMUL[3:0] bits (PLL multiplication factor) */
#define IAP_RCC_CFGR_PLLSRC                     ((IAP_uint32_t)0x00010000)        /*!< PLL entry clock source */
#define IAP_RCC_CFGR2_PREDIV1                   ((IAP_uint32_t)0x0000000F)        /*!< PREDIV1[3:0] bits */
#define IAP_RCC_CFGR_HPRE                       ((IAP_uint32_t)0x000000F0)        /*!< HPRE[3:0] bits (AHB prescaler) */
#define IAP_RCC_CFGR_PPRE                       ((IAP_uint32_t)0x00000700)        /*!< PRE[2:0] bits (APB prescaler) */
#define IAP_RCC_CFGR3_ADCSW                     ((IAP_uint32_t)0x00000100)        /*!< ADCSW bits */ 
#define IAP_HSI14_VALUE                          ((IAP_uint32_t)14000000)
#define IAP_RCC_CFGR_ADCPRE                     ((IAP_uint32_t)0x00004000)        /*!< ADCPRE bit (ADC prescaler) */
#define IAP_RCC_CFGR3_CECSW                     ((IAP_uint32_t)0x00000040)        /*!< CECSW bits */ 
#define IAP_LSE_VALUE                             ((IAP_uint32_t)32768)  
#define IAP_RCC_CFGR3_I2C1SW                    ((IAP_uint32_t)0x00000010)        /*!< I2C1SW bits */ 
#define IAP_RCC_CFGR3_USART1SW                  ((IAP_uint32_t)0x00000003)        /*!< USART1SW[1:0] bits */
#define IAP_RCC_CFGR3_USART1SW_0                ((IAP_uint32_t)0x00000001)   
#define IAP_RCC_CFGR3_USART1SW_1                ((IAP_uint32_t)0x00000002)   
#define IAP_USART_DE_ENABLE                      ((IAP_uint32_t)0x4000)

#define IAP_FLASH_R_BASE          (IAP_AHBPERIPH_BASE + 0x00002000) /*!< FLASH registers base address */
#define IAP_FLASH               ((IAP_FLASH_TypeDef *) IAP_FLASH_R_BASE)
#define IAP_FLASH_CR_LOCK                       ((IAP_uint32_t)0x00000080)        /*!< Lock */
#define IAP_FLASH_FKEY1                          ((IAP_uint32_t)0x45670123)        /*!< Flash program erase key1 */
#define IAP_FLASH_FKEY2                          ((IAP_uint32_t)0xCDEF89AB)        /*!< Flash program erase key2: used with FLASH_PEKEY1*/
#define IAP_FLASH_ER_PRG_TIMEOUT         ((IAP_uint32_t)0x000B0000)
#define IAP_FLASH_CR_PER                        ((IAP_uint32_t)0x00000002)        /*!< Page Erase */
#define IAP_FLASH_CR_STRT                       ((IAP_uint32_t)0x00000040)        /*!< Start */
#define IAP_FLASH_FLAG_BSY                 ((IAP_uint32_t)0x00000001)     /*!< FLASH Busy flag */
#define IAP_FLASH_FLAG_PGERR               ((IAP_uint32_t)0x00000004)    /*!< FLASH Programming error flag */
#define IAP_FLASH_FLAG_WRPERR              ((IAP_uint32_t)0x00000010)  /*!< FLASH Write protected error flag */
#define IAP_FLASH_FLAG_EOP                 ((IAP_uint32_t)0x00000020)        /*!< FLASH End of Programming flag */
        /*!< defines 'read / write' permissions              */
#define IAP_FLASH_CR_PG                         ((IAP_uint32_t)0x00000001)        /*!< Programming */

#define CLI()                           __set_PRIMASK(1)  
#define IAP_NVIC_BASE           (IAP_SCS_BASE +  0x0100UL)                    /*!< NVIC Base Address                 */
#define IAP_NVIC                ((IAP_NVIC_Type      *)     IAP_NVIC_BASE     )   /*!< NVIC configuration struct          */
#define IAP_UPGRADE_CODE        (0x08000000)
#define IAP_UPGRADE_DEVICE      (0x0800C000)
#define IAP_UPGRADE_VERSION     (0x0800D000)

#define PACKET_LENGTH            (128 & 0xFFFF)
#define RECEIVE_SIZE              (256)
#define RESPOND_LENGTH            (16 & 0xFFFF)
#define MESSGAE_SIZE               (16)

#define ALL_SECTOR               60
#define CYCLE_TIMES              240
#define RECEIVE_COMPLETE          (0)
#define PAGE_SIZE                  (0x400)
#define CODE_PAGE_NUMBER          (52)
#define DEVICE_PAGE_NUMBER        (4)
#define VERSION_PAGE_NUMBER       (4)
#define PROGRAMME_LENGTH        (0x04)
#define IAP_SECTOR_ERASE_TIMES     4


