JacksonOvO/Software_VX_4208/Drivers/inc/STM32F0IAPDriver.h
/*添加CRC*/
//#define IAP_CRC16_USETABLE          ( 1 )
//#define IAP_STATIC                         static

typedef unsigned char IAPUBYTE;
typedef unsigned short IAPUSHORT;


/*从网关接收请求帧长度*/
#define FROM_GW_REQUEST_FRAME_LEN          (160)

/*升级类型指示*/
#define IAP_TYPE_INDICATE_REQ          1

/*升级内容指示*/
#define IAP_CONTENT_REQ                2

/*升级结束指示*/
#define IAP_COMPLETE_REQ               3

#define BIT_16        (16)

#define IAP_HARDWARE_VERSION1_LOCATION  (2) /* 产品批次1位于诊断信息的第四位*/
#define IAP_HARDWARE_VERSION2_LOCATION  (3) /* 产品批次1位于诊断信息的第四位*/
#define IAP_PRODUCT_BATCH1_LOCATION  (4) /* 产品批次1位于诊断信息的第四位*/
#define IAP_PRODUCT_BATCH2_LOCATION  (5) /* 产品批次2位于诊断信息的第五位*/
#define IAP_PRODUCT_SERIALNUM1_LOCATION  (6)  /*  产品序列号1位于诊断信息的第六位*/
#define IAP_PRODUCT_SERIALNUM2_LOCATION  (7)  /*  产品序列号2位于诊断信息的第七位*/
#define IAP_PRODUCT_BATCH_LOCATION_OFFSET  (8) /*产品批次偏移*/

/*产品批次错误*/
#define IAP_PRODUCT_BATCHES_ERROR         0x1
/*序列号错误*/
#define IAP_SERIAL_NUM_ERROR              0x2
/*升级类型错误*/
#define IAP_UPGRADE_TYPE_ERROR            0x4
/*系统升级成功*/
#define SYSTEM_UPGRADE_REQ_HANDLE_SUCCESS  0x0
/*升级包长度错误*/
#define IAP_UPGRADE_PACKAGE_LEN_ERROR     0x06
/*升级包序号错误*/
#define IAP_UPGRADE_PACKAGE_NUM_ERROR      0x5
#define IAP_UPGRADE_PACKAGE_CONTENT_LOCATION  10
/*未知错误*/
#define IAP_UNKNOW_ERROR                  0x99

/*FLASH擦除失败*/
#define IAP_FLASH_ERASER_ERROR           0x10

/*FLASH写入失败*/
#define IAP_FLASH_WRITE_ERROR             0x7

/*程序升级*/
#define IAP_PROGRAM_UPGRADE                0
/*设备描述文件升级*/
#define IAP_DEVICE_FILE                   1
/*杂项数据改写*/
#define IAP_VERSION_DATA                  2

/*代码扇区*/
#define IAP_CODE_SECTOR_NUM                   12
/*13*1024 /128 = 104*/
#define IAP_MAX_PROGRAM_UPGRADE_PACKAGE_COUNT (104*4)  
#define PAGE_PROGRAMME_TIME       (32)/*128 / 4 = 32*/
#define IAP_FLASH_SECTOR_SIZE     128
/*设备描述文件扇区*/
#define IAP_DEVICE_SECTOR_NUM                 1
#define IAP_MAX_DEVICE_UPGRADE_PACKAGE_COUNT  8
/*杂项数据扇区*/
#define IAP_VERSION_SECTOR_NUM                1
#define IAP_MAX_VERSION_UPGRADE_PACKAGE_COUNT  8


/* 除产品信息外的其他诊断数 */
#define IAP_COMMON_DIAGNOSE_NUM (2)
/* 产品信息长度 */
#define IAP_PRODUCT_INFO_NUMBER (6)
/* 诊断数据定义 */
#define IAP_MAX_DIAGNOSE_DATA_NUM   (IAP_COMMON_DIAGNOSE_NUM + IAP_PRODUCT_INFO_NUMBER)     /* 最大诊断数 */

#define IAP_PRODUCT_BATCH1_SIZE               2
#define IAP_PRODUCT_BATCH2_SIZE               2
#define IAP_PRODUCT_BATCH_SIZE               4
#define IAP_PRODUCT_BATCH_LOCATION           2 

#define IAP_PRODUCT_SERIAL_NUM1_SIZE          2 
#define IAP_PRODUCT_SERIAL_NUM2_SIZE         2 
#define IAP_PRODUCT_SERIAL_NUM_SIZE          4  
#define IAP_PRODUCT_SERIAL_NUM_LOCATION      6 

#define IAP_UPGRADE_TYPE_SIZE               1
#define IAP_UPGRADE_TYPE_LOCATION           2 
#define IAP_UPGRADE_PACKAGE_SIZE            2

#define IAP_UPGRADE_PACKAGE_SN_SIZE        (4) /*升级包序列号的长度为4*/
#define IAP_END_MARK_LENGTH                  1
#define IAP_UPGRADE_CONTENT_REQ_FRAME_SIZE  (9) /*升级内容请求帧的长度为9*/
#define END_MASK                            1
#define IAP_GW_STATION_NUM_LOCATION         0      /*网关站号处于响应帧第0位*/
#define IAP_GW_STATION_NUM_LEN              1
#define IAP_CONTENT_RESPONSE_SIZE           7
  
#define IAP_SLAVE_UPGRADE_PACKAGE_SIZE      128
#define IAP_TO_NEXT_SN                      1

/*响应帧*/
#define GW_STATION_NUM                      0xFE
#define GW_STATION_LOCATION                 0
#define SLAVE_STATION_LOCATION              1
#define FRAME_TYPE_LOCATION                 2
#define IAP_COMPLETE_HANDLE_RESULT_LOCATION 3
#define UPGRADE_TYPE_LOCATION               3
#define IAP_TYPE__HANDLE_RESULT_LOCATION    4
#define IAP_TYPE_RESPONSE_FRAME_LEN         5
#define IAP_COMPLETE_RESPONSE_FRAME_LEN     4
#define IAP_UPGRADE_TYPE_LOCATE             10
#define IAP_UPGRADE_PACKAGE_TYPE_ERROR      0x08
#define IAP_UPGRADE_PACKAGE_TYPE_LOCATE     5
#define IAP_UPGRADE_PACKAGE_TYPE_SIZE        1
#define IAP_PACKAGE_RETRANSMISSION_SIZE          1
#define IAP_NOT_PACKAGE_RETRANSMISSION      0
#define IAP_PACKAGE_RETRANSMISSION      1
#define IAP_PACKAGE_RETRANSMISSION_ERROR      0x0A


#define IAP_HARDWARE_VERSION_ANZAHL_LOCATE  1
#define IAP_HARDWARE_VERSION_ANZAHL_SIZE    1
#define IAP_SLAVE_UPGRADE_PACKAGE_TYPE_LOCATE    0



#define IAP_HARDWARE_VERSION_NUM_ERROR      0x09
#define IAP_HARDWARE_VERSION_NUM_LOCATE     13
#define IAP_HARDWARE_VERSION_NUM1_SIZE       2
#define IAP_HARDWARE_VERSION_NUM2_SIZE       2
#define IAP_HARDWARE_VERSION_NUM_SIZE       4
/*升级信息最大长度 */
#define IAP_MAX_IO_UPGRADE_INFO_LENGTH  (256)

/*请求帧*/
#define FROM_GW_SLAVE_STATION_LOCATION      0
#define FROM_GW_FRAME_TYPE_LOCATION         1

#define IAP_USART_DEAT_VALUE        (16)
#define IAP_USART_CR1_DEAT          ((IAP_uint32_t)0x03E00000)           

#define IAP_PRODUCTBATCH_SERIAL_NUM_LEN     4
#ifndef IAP_NULL
#define IAP_NULL    ((void *)0)
#endif

/*软复位*/
/* IO definitions (access restrictions to peripheral registers) */
#ifdef __cplusplus
  #define   _IAP__I     volatile             /*!< defines 'read only' permissions                 */
#else
  #define   _IAP__I     volatile const       /*!< defines 'read only' permissions                 */
#endif

typedef struct
{
  _IAP__I  IAP_uint32_t CPUID;                   /*!< Offset: 0x000 (R/ )  CPUID Base Register                                   */
  __IAP_IO IAP_uint32_t ICSR;                    /*!< Offset: 0x004 (R/W)  Interrupt Control and State Register                  */
       IAP_uint32_t RESERVED0;
  __IAP_IO IAP_uint32_t AIRCR;                   /*!< Offset: 0x00C (R/W)  Application Interrupt and Reset Control Register      */
  __IAP_IO IAP_uint32_t SCR;                     /*!< Offset: 0x010 (R/W)  System Control Register                               */
  __IAP_IO IAP_uint32_t CCR;                     /*!< Offset: 0x014 (R/W)  Configuration Control Register                        */
       IAP_uint32_t RESERVED1;
  __IAP_IO IAP_uint32_t SHP[2];                  /*!< Offset: 0x01C (R/W)  System Handlers Priority Registers. [0] is RESERVED   */
  __IAP_IO IAP_uint32_t SHCSR;                   /*!< Offset: 0x024 (R/W)  System Handler Control and State Register             */
} IAP_SCB_Type;

