JacksonOvO/Software_VX_4208/Drivers/inc/STM32F0IAPDriver.h
#define IAP_SCB_BASE            (IAP_SCS_BASE +  0x0D00UL)                    /*!< System Control Block Base Address */
#define IAP_SCB                 ((IAP_SCB_Type       *)     IAP_SCB_BASE      )   /*!< SCB configuration struct           */    

#define IAP_SCB_AIRCR_SYSRESETREQ_Pos           2                                             /*!< SCB AIRCR: SYSRESETREQ Position */
#define IAP_SCB_AIRCR_SYSRESETREQ_Msk          (1UL << IAP_SCB_AIRCR_SYSRESETREQ_Pos)             /*!< SCB AIRCR: SYSRESETREQ Mask */


#if   defined ( __CC_ARM )
#define IAP__DSB()                           __dsb(0xF)

  #define __ASM            __asm                                      /*!< asm keyword for ARM Compiler          */
  #define __INLINE         __inline                                   /*!< inline keyword for ARM Compiler       */

#elif defined ( __ICCARM__ )
  #define __ASM           __asm                                       /*!< asm keyword for IAR Compiler          */
  #define __INLINE        inline                                      /*!< inline keyword for IAR Compiler. Only available in High optimization mode! */

#elif defined ( __GNUC__ )
  #define __ASM            __asm                                      /*!< asm keyword for GNU Compiler          */
  #define __INLINE         inline                                     /*!< inline keyword for GNU Compiler       */

#elif defined ( __TASKING__ )
  #define __ASM            __asm                                      /*!< asm keyword for TASKING Compiler      */
  #define __INLINE         inline                                     /*!< inline keyword for TASKING Compiler   */
#endif  //__CC_ARM


/*DMA4，5通道*/
#define IAP_DMA1_Channel4_BASE    (IAP_DMA1_BASE + 0x00000044)
#define IAP_DMA1_Channel4       ((IAP_DMA_Channel_TypeDef *) IAP_DMA1_Channel4_BASE)
#define IAP_DMA1_Channel5_BASE    (IAP_DMA1_BASE + 0x00000058)
#define IAP_DMA1_Channel5       ((IAP_DMA_Channel_TypeDef *) IAP_DMA1_Channel5_BASE)

/*软复位*/
#define IAP_RESET               (0x05FA0000| 0x04)
#define IAP_CRC16_VALUE_LENGTH     (2)
#define IAP_CRC16_VALUE_NOERR     (0)

/******************************************************************
*                           全局变量声明                          *
******************************************************************/

/******************************************************************
*                         全局函数声明                            *
******************************************************************/
#endif

